### Importing the Packages

In [1]:
#Se importa la biblioteca Pandas con el alias "pd"
#Esto importa la biblioteca NumPy con el alias "np".
import pandas as pd
import numpy as np
#import matplotlib.pyplot as plt 
#import seaborn as sns
#sns.set()

### Importing the data

In [2]:
#Cargo los datos desde un archivo CSV llamado "df_comp.csv" en un DataFrame llamado "raw_csv_data" utilizando la función "pd.read_csv()"
raw_csv_data = pd.read_csv("df_comp.csv")
#Crea una copia del DataFrame raw_csv_data y lo asigno a la variable df_comp.
df_comp=raw_csv_data.copy()

### Lenght of the Time Period

In [3]:
#Resumen estadístico de las columnas numéricas
df_comp.describe()

              ftse          dax          spx         nikkei
count  1245.000000   1245.000000  1245.000000   1245.000000
mean   7072.865867  13668.384585  3691.250659  25729.274013
std     566.716325   1681.478900   638.483493   3635.387496
min    4993.899902   8441.709961  2237.399902  16552.830078
25%    6837.399902  12401.200195  3066.909912  22418.150391
50%    7220.100098  13544.519531  3830.169922  26781.679688
75%    7471.500000  15365.139648  4207.270020  28437.769531
max    8014.299805  16469.750000  4796.560059  33753.328125

In [4]:
#Vista previa de los datos (5)
df_comp.head()

         date         ftse          dax          spx         nikkei
0  2018-12-03  7062.399902  11465.459961  2790.370117  22574.759766
1  2018-12-04  7022.799805  11335.320312  2700.060059  22036.050781
2  2018-12-05  6921.799805  11200.240234  2700.060059  21919.330078
3  2018-12-06  6704.100098  10810.980469  2695.949951  21501.619141
4  2018-12-07  6778.100098  10788.089844  2633.080078  21678.679688

In [5]:
#Describe la información sobre la columna "date" (fechas)
df_comp.date.describe()

count           1245
unique          1245
top       2018-12-03
freq               1
Name: date, dtype: object

### From Text to Date

In [6]:
#Modifico el formato de la columna date:  de texto a fecha y hora
df_comp.date = pd.to_datetime(df_comp.date, dayfirst=True, errors='coerce')

In [7]:
#Vista previa de los datos (5)
df_comp.head()

        date         ftse          dax          spx         nikkei
0 2018-03-12  7062.399902  11465.459961  2790.370117  22574.759766
1 2018-04-12  7022.799805  11335.320312  2700.060059  22036.050781
2 2018-05-12  6921.799805  11200.240234  2700.060059  21919.330078
3 2018-06-12  6704.100098  10810.980469  2695.949951  21501.619141
4 2018-07-12  6778.100098  10788.089844  2633.080078  21678.679688

In [8]:
#Describe la información sobre la columna "date" (fechas)
df_comp.date.describe()

count                              494
mean     2021-04-19 17:11:54.170040576
min                2018-03-12 00:00:00
25%                2020-02-06 06:00:00
50%                2021-04-09 00:00:00
75%                2022-07-02 18:00:00
max                2023-12-07 00:00:00
Name: date, dtype: object

In [9]:
#Confirmo que está en formato de fecha y hora 
print(df_comp['date'].dtype)

datetime64[ns]

### Setting the Index

In [10]:
#Uso la columna de fechas (date) como índice para realizar análisis, filtrado y visualización relacionados con el tiempo
df_comp.set_index("date")

                   ftse          dax          spx         nikkei
date
2018-03-12  7062.399902  11465.459961  2790.370117  22574.759766
2018-04-12  7022.799805  11335.320312  2700.060059  22036.050781
2018-05-12  6921.799805  11200.240234  2700.060059  21919.330078
2018-06-12  6704.100098  10810.980469  2695.949951  21501.619141
2018-07-12  6778.100098  10788.089844  2633.080078  21678.679688
...                 ...           ...          ...           ...
2023-04-09  7452.799805  15824.849609  4515.770020  32939.179688
2023-05-09  7437.899902  15771.709961  4496.830078  33036.761719
2023-06-09  7426.100098  15741.370117  4465.479980  33241.019531
2023-07-09  7441.700195  15718.660156  4451.140137  32991.078125
2023-08-09  7478.200195  15740.299805  4457.490234  32606.839844

[1245 rows x 4 columns]

In [11]:
#Establezco la columna "date" como índice del DataFrame df_comp, y esta modificación se realizará en el mismo df_comp
df_comp.set_index("date", inplace=True)

In [12]:
#Vista previa de los datos (5)
df_comp.head()

                   ftse          dax          spx         nikkei
date
2018-03-12  7062.399902  11465.459961  2790.370117  22574.759766
2018-04-12  7022.799805  11335.320312  2700.060059  22036.050781
2018-05-12  6921.799805  11200.240234  2700.060059  21919.330078
2018-06-12  6704.100098  10810.980469  2695.949951  21501.619141
2018-07-12  6778.100098  10788.089844  2633.080078  21678.679688

In [13]:
#df_comp.date.describe() ##Espera obtener un mensaje de error porque ya no tenemos columna "date" ya que es el índice
df_comp.date.describe()

AttributeError: 'DataFrame' object has no attribute 'date'

### Setting the Desired Frequency

In [14]:
#Antes de aplicar asfreq, debo verificar si hay filas duplicadas en tu DataFrame y eliminarlas. 
df_comp = df_comp[~df_comp.index.duplicated(keep='first')]

#df_comp contendrá observaciones diarias, incluyendo todos los días del calendario, tanto días laborables como fines de semana.
#útil para cuando se quiere considerar todos los días calendario en el análisis
df_comp=df_comp.asfreq('d')

In [15]:
#Describe toda la información
df_comp
##Se obersa que pasamos de tener 1245 rows × 4 columns a 1741 rows × 4 columns

                   ftse          dax          spx         nikkei
date
2018-03-12  7062.399902  11465.459961  2790.370117  22574.759766
2018-03-13          NaN           NaN          NaN           NaN
2018-03-14          NaN           NaN          NaN           NaN
2018-03-15          NaN           NaN          NaN           NaN
2018-03-16          NaN           NaN          NaN           NaN
...                 ...           ...          ...           ...
2023-12-03          NaN           NaN          NaN           NaN
2023-12-04  7824.799805  15703.599609  4091.949951  28082.699219
2023-12-05  7754.600098  15913.820312  4124.080078  29388.300781
2023-12-06  7570.700195  16097.870117  4338.930176  32434.000000
2023-12-07  7416.100098  16023.000000  4472.160156  31943.929688

[2097 rows x 4 columns]

In [16]:
#df_compcontendrá solo observaciones en días laborables, y las fechas en fines de semana y días no laborables se habrán omitido o ajustado según la frecuencia especificada.
df_comp=df_comp.asfreq('b')

In [17]:
#Vista previa de los datos (5)
df_comp.head()

                   ftse          dax          spx         nikkei
date
2018-03-12  7062.399902  11465.459961  2790.370117  22574.759766
2018-03-13          NaN           NaN          NaN           NaN
2018-03-14          NaN           NaN          NaN           NaN
2018-03-15          NaN           NaN          NaN           NaN
2018-03-16          NaN           NaN          NaN           NaN

In [18]:
#Describe toda la información
df_comp
##Se obersa que pasamos de tener 1741 rows × 4 columns a 1245 rows × 4 columns

                   ftse          dax          spx         nikkei
date
2018-03-12  7062.399902  11465.459961  2790.370117  22574.759766
2018-03-13          NaN           NaN          NaN           NaN
2018-03-14          NaN           NaN          NaN           NaN
2018-03-15          NaN           NaN          NaN           NaN
2018-03-16          NaN           NaN          NaN           NaN
...                 ...           ...          ...           ...
2023-12-01  7794.000000  15058.299805  3983.169922  26449.820312
2023-12-04  7824.799805  15703.599609  4091.949951  28082.699219
2023-12-05  7754.600098  15913.820312  4124.080078  29388.300781
2023-12-06  7570.700195  16097.870117  4338.930176  32434.000000
2023-12-07  7416.100098  16023.000000  4472.160156  31943.929688

[1499 rows x 4 columns]

### Handling Missing Values

In [19]:
# Esta máscara booleana es útil para identificar la ubicación de los valores nulos en su DataFrame original
# "True" en las ubicaciones donde hay valores nulos y "False" donde los valores no son nulos.
df_comp.isna()

             ftse   dax    spx   nikkei
date
2018-03-12  False  False  False   False
2018-03-13   True   True   True    True
2018-03-14   True   True   True    True
2018-03-15   True   True   True    True
2018-03-16   True   True   True    True
...           ...    ...    ...     ...
2023-12-01  False  False  False   False
2023-12-04  False  False  False   False
2023-12-05  False  False  False   False
2023-12-06  False  False  False   False
2023-12-07  False  False  False   False

[1499 rows x 4 columns]

In [20]:
#Nos muestra la cantidad de valores nulos en cada columna del DataFrame "df_comp"
df_comp.isna().sum()

ftse      1147
 dax      1147
spx       1147
nikkei    1147
dtype: int64

In [21]:
#Describe toda la información
df_comp

                   ftse          dax          spx         nikkei
date
2018-03-12  7062.399902  11465.459961  2790.370117  22574.759766
2018-03-13          NaN           NaN          NaN           NaN
2018-03-14          NaN           NaN          NaN           NaN
2018-03-15          NaN           NaN          NaN           NaN
2018-03-16          NaN           NaN          NaN           NaN
...                 ...           ...          ...           ...
2023-12-01  7794.000000  15058.299805  3983.169922  26449.820312
2023-12-04  7824.799805  15703.599609  4091.949951  28082.699219
2023-12-05  7754.600098  15913.820312  4124.080078  29388.300781
2023-12-06  7570.700195  16097.870117  4338.930176  32434.000000
2023-12-07  7416.100098  16023.000000  4472.160156  31943.929688

[1499 rows x 4 columns]

In [23]:
#Los valores faltantes en la columna "spx" se llenarán con los valores no nulos más cercanos anteriores en la misma columna.
df_comp["spx "]=df_comp["spx "].ffill()

In [24]:
#Resumen de la cantidad de valores faltantes en cada columna de un DataFrame de pandas
df_comp.isna().sum()

ftse      1147
 dax      1147
spx          0
nikkei    1147
dtype: int64

In [25]:
# Los valores faltantes en la columna "ftse" se llenarán con los valores no nulos más cercanos siguientes en la misma columna
df_comp['ftse']=df_comp['ftse'].bfill()

In [26]:
#Los valores faltantes en la columna "dax" se llenarán con el valor promedio de esa misma columna.
df_comp[' dax ']=df_comp[' dax '].fillna(value = df_comp[' dax '].mean())

### Simplifying the Dataset

In [27]:
# Se crea una nueva columna llamada "market_value" que contiene los mismos datos que la columna "spx ".
df_comp['market_value']=df_comp["spx "]

In [28]:
#Describe la información estadística de las columnas númericas
df_comp.describe()

              ftse          dax          spx         nikkei  market_value
count  1499.000000   1499.000000  1499.000000    352.000000   1499.000000
mean   7112.778331  13645.493949  3672.295270  25681.731562   3672.295270
std     510.291276    805.287608   685.601165   3588.618857    685.601165
min    5237.500000   9161.129883  2447.889893  17818.720703   2447.889893
25%    6732.250000  13645.493949  3066.909912  22328.856934   3066.909912
50%    7177.399902  13645.493949  3719.889893  26805.174805   3719.889893
75%    7542.399902  13645.493949  4363.549805  28317.357422   4363.549805
max    7947.100098  16152.610352  4796.560059  33753.328125   4796.560059

In [29]:
#Elimina la columna "spx " 
del df_comp['spx ']

In [30]:
#Describe la información estadística de las columnas númericas
df_comp.describe()

              ftse          dax         nikkei  market_value
count  1499.000000   1499.000000    352.000000   1499.000000
mean   7112.778331  13645.493949  25681.731562   3672.295270
std     510.291276    805.287608   3588.618857    685.601165
min    5237.500000   9161.129883  17818.720703   2447.889893
25%    6732.250000  13645.493949  22328.856934   3066.909912
50%    7177.399902  13645.493949  26805.174805   3719.889893
75%    7542.399902  13645.493949  28317.357422   4363.549805
max    7947.100098  16152.610352  33753.328125   4796.560059

In [31]:
#Elimino todas las columnas excepto "market_value" 
del df_comp[' dax ']
del df_comp['ftse']
del df_comp['nikkei']

In [32]:
#Describe la información estadística de las columnas númericas
df_comp.describe()

       market_value
count   1499.000000
mean    3672.295270
std      685.601165
min     2447.889893
25%     3066.909912
50%     3719.889893
75%     4363.549805
max     4796.560059

### Splitting the Data

In [33]:
#La variable "size" contiene el número de filas que representan el 80% del total de filas en el DataFrame "df_comp"
# Esto se utiliza en tareas de partición de datos, como dividir un conjunto de datos en un conjunto de entrenamiento (80%) y un conjunto de prueba (20%)
size = int(len(df_comp)*0.8)

In [34]:
#Un nuevo DataFrame "df" contendrá las primeras 'size' filas de 'df_comp'. ##CONJUNTO DE ENTRANAMIENTO (80%)
df = df_comp.iloc[:size]

In [35]:
#Un nuevo DataFrame "df_test" contendrá todas las filas df_compdesde la fila en la posición sizeen adelante. ##CONJUNTO DE PRUEBA (20%)
df_test = df_comp.iloc[size:]

In [45]:
#Muestra las últimas filas de un DataFrame
df.tail()

            market_value
date
2022-09-20   3855.929932
2022-09-21   3789.929932
2022-09-22   3757.989990
2022-09-23   3693.229980
2022-09-26   3655.040039

In [46]:
#Vista previa de los datos (5)
df_test.head()

            market_value
date
2022-09-27   3647.290039
2022-09-28   3719.040039
2022-09-29   3640.469971
2022-09-30   3585.620117
2022-10-03   3678.429932